app/Http/Controllers/Auth/RegisteredUserController.php

    public function create(): View
    {
        $elements = DB::table('region')->get();
---
select * from "region"

    public function store(Request $request): RedirectResponse
    {

            $request->validate([
            'id_region' => 'required|exists:region,id',
             'fullname' => ['required', 'string', 'max:255'],
             'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
             'password' => ['required', 'confirmed', Rules\Password::defaults()],
         ]);

        $user = User::create([
            'fullname' => $request->fullname,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'id_region' => $request->id_region,
        ]);
---
insert into "users" ("fullname", "email", "password", "id_region", "updated_at", "created_at") values ('Wahbi Baklouti', 'wahbibaklouti7@gmail.com', '$2y$12$Wr3zmCFCpZuqa7sTWra3Au4.jNPaBCXlkRsU.59J7jei8OVXnGIy2', '16', '2024-09-01 19:53:28', '2024-09-01 19:53:28') returning "id"