Modules/demandeur/Annonce/App/Http/Controllers/AnnonceAVSController.php

select * from "users_data" where "service" = 'avs' and "unit" = 'gender' order by "orders" asc
select * from "users_data" where "service" = 'avs' and "unit" = 'type_service' order by "orders" asc
select * from "users_data" where "service" = 'avs' and "unit" = 'symptoms' order by "orders" asc
---
    public function create()
    {
        // Retrieve the specific label based on the fixed parameters and order by 'orders'
        $elements = DB::table('users_data')
            ->where('service', 'avs')
            ->where('unit', 'gender')
            ->orderBy('orders', 'asc') // Order by 'orders' in ascending order
            ->get();

        $services = DB::table('users_data')
            ->where('service', 'avs')
            ->where('unit', 'type_service')
            ->orderBy('orders', 'asc') // Order by 'orders' in ascending order
            ->get();

        $symptoms = DB::table('users_data')
            ->where('service', 'avs')
            ->where('unit', 'symptoms')
            ->orderBy('orders', 'asc') // Order by 'orders' in ascending order
            ->get();