Modules/demandeur/Annonce/App/Http/Controllers/AnnonceBabySitterController.php

select * from "users_data" where "service" = 'babysitter' and "unit" = 'child_age' order by "orders" asc
select * from "users_data" where "service" = 'babysitter' and "unit" = 'type_service' order by "orders" asc
---
    public function create()
    {
        // Retrieve the specific label based on the fixed parameters and order by 'orders'
        $elements = DB::table('users_data')
            ->where('service', 'babysitter')
            ->where('unit', 'child_age')
            ->orderBy('orders', 'asc') // Order by 'orders' in ascending order
            ->get();

        $services = DB::table('users_data')
            ->where('service', 'babysitter')
            ->where('unit', 'type_service')
            ->orderBy('orders', 'asc') // Order by 'orders' in ascending order
            ->get();