Modules/demandeur/Annonce/App/Http/Controllers/AnnonceAnimauxController.php

    public function create()
    {
        // Retrieve the specific label based on the fixed parameters and order by 'orders'
        $elements = DB::table('users_data')
            ->where('service', 'animal')
            ->where('unit', 'type_service')
            ->orderBy('orders', 'asc') // Order by 'orders' in ascending order
            ->get();

        $services = DB::table('users_data')
            ->where('service', 'animal')
            ->where('unit', 'can')
            ->orderBy('orders', 'asc') // Order by 'orders' in ascending order
            ->get();
---
select * from "users_data" where "service" = 'animal' and "unit" = 'type_service' order by "orders" asc
select * from "users_data" where "service" = 'animal' and "unit" = 'can' order by "orders" asc